# PhyMaterialParamCompressionParallel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamCompressionParallel Property
ParameterTypeId Class See Also
---
"Compression parallel to grain"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamCompressionParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamCompressionParallel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamCompressionParallel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace